#+title: Quickstart
#+options: author:nil date:nil

* This is the first step of Python programming!
When you start to learn new computing language, it's a nice idea to say hello to the new world.
#+begin_src ipython :exports code :results raw drawer
  import sample_hello
  sample_hello.world()
#+end_src
This is the best greeting ever.

** running codes
This code runs when exporting to reST from the emacs-org document.
#+NAME:test-code
#+begin_src python :exports both :results raw drawer
  import numpy as np
  a = np.arange(10)
  return a
#+end_src

#+RESULTS: test-code
:results:
[0 1 2 3 4 5 6 7 8 9]
:end:

* Test of equations
We would like to write mathematics like \(\chi^2 = \left[ (D - M)/\sigma \right]^2\) and
\begin{equation}
\label{eq:1}
\chi^2 = \left( \frac{D-M}{\sigma} \right)^2,
\end{equation}
where \(D\) is the data, \(M\) the model, and \(\sigma\) is the uncertainty.

* Test of writing
** List
- This is the first.
- This is the second.
- This is the third.

** List 2
- First :: This is the first.
- Second :: This is the second.
- Third :: This is the third.

** Table
| Name      | SFR | Mass |
|-----------+-----+------|
| Galaxy    |   1 |   11 |
| B14-65666 | 200 |   10 |
| Human     |   0 |  -29 |

* directives
#+begin_note
This is note.
#+end_note

#+begin_warning
This is warning.
#+end_warning

#+begin_caution
This is caution.
#+end_caution

#+begin_important
This is important.
#+end_important

#+begin_tip
This is tip.
#+end_tip

#+begin_hint
This is hint.
#+end_hint

#+begin_attention
This is attention.
#+end_attention

#+begin_danger
This is danger.
#+end_danger
